# -*- coding: utf-8 -*-


from openerp import models, fields, api, _


class HrEmployeeHistory(models.Model):
    _name = 'hr.employee.history'
    _description = u'سجل الاجراءات'

    employee_id = fields.Many2one('hr.employee', string=u'الموظف', required=1)
    date = fields.Date(string=u'التاريخ')
    num_decision = fields.Char(string=u'رقم القرار')
    date_decision = fields.Date(string=u'تاريخ القرار')
    operation_type = fields.Selection([('01', u'منح إجازة عادية'),
                             ('02', u'منح إجازة استثنائية بدون راتب'),
                             ('03', u'عودة بعد لإجازة'),
                             ('04', u'حسم غياب'),
                             ('05', u'حسم من بدل النقل'),
                             ('06', u'جزاء'),
                             ('07', u'حسم تاخير وخروج'),
                             ('08', u'منح إجازة مرضية براتب كامل'),
                             ('09', u'منح إجازة مرضية بنصف راتـب '),
                             ('10', u'مباشرة بعد التعيين'),
                             ('11', u' اعفاء'),
                             ('12', u'ترقية بأثر رجعي '),
                             ('13', u'تحسين وضع '),
                             ('14', u' تعديل اسم'),
                             ('15', u' تعديل توجيه'),
                             ('16', u'تكليف '),
                             ('17', u'تعيين جديــد '),
                             ('18', u' منح إجازة مرضية بربع راتـب'),
                             ('19', u'انهاء خدمة '),
                             ('21', u' اجازة رياضية'),
                             ('22', u'  تسوية'),
                             ('23', u' الغاء تسوية'),
                             ('24', u'استقاله بموافقة اللجنة علي قبولها '),
                             ('25', u' تعاقد غير سعودي'),
                             ('26', u' تجديد عقد '),
                             ('27', u' تقاعد لسبب العجز'),
                             ('28', u' خفض وظيفة'),
                             ('29', u' منح إجازة مرضية بدون راتـب'),
                             ('30', u' منح إجازة دراسية '),
                             ('31', u'تخفيض وظيفة '),
                             ('32', u' منح إجازة بعثة دراسية بنصف راتب'),
                             ('33', u' منح إجازة بعثة دراسية بدون راتب'),
                             ('34', u'مباشرة بعد الإجازة الإستثنائيه '),
                             ('35', u' الغاء الاجازه'),
                             ('36', u'مباشرة العمل بعد الإجازة '),
                             ('37', u' مباشرة بعد الإجازة المرضية'),
                             ('38', u' إحالة إلى التقاعد تأديبيا'),
                             ('39', u' نقل بترقية'),
                             ('40', u'انذار '),
                             ('41', u' كـف اليـد'),
                             ('42', u'مباشرة بعد الاعارة '),
                             ('43', u' إجازة مرافقة'),
                             ('44', u' تمديد عادية'),
                             ('45', u' تكليف بوظيفة شاغرة بتفرغ'),
                             ('46', u' تكليف بوظيفة بالاضافة الى عمله'),
                             ('47', u' عـلاوة إضافية'),
                             ('48', u' ندب الى مصلحة حكومية'),
                             ('49', u' إعارة'),
                             ('50', u' علاوة'),
                             ('51', u' دورة تدريبية'),
                             ('52', u' ابتعاث'),
                             ('53', u' علاوة ترقية'),
                             ('54', u' وفــــاة'),
                             ('55', u' فصل من الخدمة'),
                             ('56', u' نقل الى موسسة حكومية اخرى'),
                             ('57', u' تقاعد'),
                             ('58', u' استقالة'),
                             ('59', u' تعيين موظف رسمي'),
                             ('60', u' تعيين من تاريخ القرار'),
                             ('61', u'تعديل تاريخ المباشرة '),
                             ('62', u' الغاء نقل'),
                             ('63', u'مباشرة العمل بعد النقل '),
                             ('64', u'نقـل '),
                             ('65', u' الغاء حسم'),
                             ('66', u' الغاء جزاء'),
                             ('67', u'تثبيت '),
                             ('68', u' الغاء إجازة مرضية'),
                             ('69', u' الغاء منحة دراسية'),
                             ('70', u' الغاء تعيين'),
                             ('71', u'الغاء إنذار '),
                             ('72', u'الغاء إنهاء خدمات '),
                             ('73', u' الغاء ترقية'),
                             ('75', u' مباشرة العمل بعد الترقية'),
                             ('76', u'ترقية '),
                             ('77', u' ترقية من تاريخ القرار'),
                             ('78', u' نقل من تاريخ القرار'),
                             ('79', u' نهاء قرار كف اليد'),
                             ('80', u'ترقية وعلاوة '),
                             ('81', u' تسوية ( تحسين وضع )'),
                             ('82', u'طي قيد '),
                             ('83', u' اجازة مرضية'),
                             ('84', u' تعيين الموظفين المستخدمين'),
                             ('85', u'تعيين عمال بند الأجور'),
                             ('86', u' تعيين بعقد'),
                             ('87', u'  تعيين غير سعودي على مرتبة رسمية'),
                             ('88', u' تعيين المحالين على التقاعد'),
                             ('89', u'لوم '),
                             ('90', u'حسم تأديبي '),
                             ('91', u' حرمان من علاوة '),
                             ('92', u'الفصل '),
                             ], string=u'الاجرا ء')
    job_id = fields.Char(string=u'مسمى الوظيفه')
    grade_id = fields.Many2one('salary.grid.grade', string='المرتبة', readonly=1)
    grade_id_number = fields.Char( string='المرتبة', related='grade_id.code')
    number = fields.Char(string='رقم الوظيفية')
    department_id = fields.Many2one('hr.department', string='الفرع')
    dep_side = fields.Char(string=u'الجهة')
    type = fields.Char('الاجرا ء')
    
    @api.multi
    def add_action_line(self, employee_id, num_decision, date_decision, operation_type):
        self.create({'employee_id': employee_id.id, 'date': fields.Datetime.now(),
                     'num_decision': num_decision, 'date_decision': date_decision,
                     'type': operation_type, 'job_id': employee_id.job_id.name.name,
                     'grade_id': employee_id.job_id.grade_id.id,
                     'number': employee_id.job_id.number,
                     'department_id': employee_id.department_id.id,
                     'dep_side': employee_id.user_id.company_id.name,
                     })
